Repository: clairvy/perl6-doc-ja
Catalog: perl6-doc-ja-level2.tmx
Source language: en_us
Languages: ja

source: All files start out being parsed in the GLOBAL package, but may switch to some other package scope depending on the first package-ish declaration.
ja: のどちらかが使えます。全てのファイルがGLOBALパッケージの中にあるとしてパースされますが，最初のパッケージ的な宣言に依存してそれ以外のパッケージスコープに変化していることもあります。

source: If that first declaration is not a package variant, then the parsing switches to the "main" package for Perl 5 code.
ja: 最初の宣言がパッケージ変数でない場合、パースはPerl5コードとしてなら"main"パッケージに変化します。

source: Perl 6 code stays GLOBAL in that situation.
ja: 同じようにPerl6のコードならGLOBALのままです。

source: The mainline code is thus in the GLOBAL namespace unless declared otherwise.
ja: それ以外に宣言されていなければ、メインラインのコードはGLOBAL名前空間のままです。

source: Package traits are set using is:
ja: パッケージトレイトはisを使って設定されます。

source: All symbolic links are done with the ::($expr) syntax, which is legal in any variable, package, module, or class name anywhere a ::Ident is legal.
ja: シンボリックリンクは、::($expr)構文を使います、これは::Identが有効な場所のどこででも全ての変数、パッケージ、モジュール、クラスの名前で有効です。

source: The string returned by the expression will be parsed for :: indicating subpackage names.
ja: この表現によって返される文字列は、::の中のサブパッケージ名を差すとしてパースされます。

source: Do not confuse this with the
ja: これをシンボルテーブルの中を検索できるようにする

source: syntax that lets you do a lookup in a particular symbol table.
ja: 構文と混同しないでください。

source: In this case, the key is not parsed for ::.
ja: この場合、キィは::の中としてパースされません。

source: It's just a hash lookup.
ja: これはハッシュの検索として働きます。

source: A declaration of any object of the form A::B::c also creates (if needed) an empty package A, and an empty package B inside of A, in addition to creating c inside of B.
ja: A::B::c形式のオブジェクトの宣言は(必要であれば)空のパッケージA、Aの中の空のパッケージB、Bの中のcを生成します。

source: Such empty packages may be subsequently be redeclared as any other package-like object (module, class, etc.), and no redeclaration warning will be issued for such a redeclaration.
ja: このように空のパッケージは他のパッケージ的なオブジェクト(モジュール、クラス他)によって再宣言されるかもしれません。このような再宣言には再宣言の警告を引き起しません。

source: If a parent package already exists, no stub package needs to be created, and no declaration of the form A::B::c has anything to say about the type of package A or package A::B, since any package variant can function as a package for the purposes of naming things.
ja: 親パッケージが既に存在する場合、スタブパッケージが作成される必要がありません。パッケージ変数は名前付けされた通りにパッケージとして機能しますので、A::B::c形式の宣言はAパッケージ、A::Bパッケージに何もしません。

source: Apart of package declaration constructs, package names are always searched for from the innermost lexical scope to outermost.
ja: パッケージ宣言の構成の一部であるパッケージ名は常に最も内側のレキシカルスコープから最も外側のそれの範囲から探されます。

source: If not defined in any surrounding lexical scope, the package is searched for from the current package up through the containing packages to GLOBAL.
ja: レキシカルスコープに囲まれて定義されていなければ、そのパッケージは現在のパッケージからGLOBALに向かって含んでいるパッケージを探されます。

source: If it is not found, a compiler error results.
ja: それでも見付からなければ、結果としてコンパイルエラーを生じます。

source: As with an initial ::, the presence of a :: within the name does not imply globalness (unlike in Perl 5).
ja: 先頭の::のような、名前の中の::は，グローバル性を意味するものではありません(Perl5と違い)。

source: True globals are always in the GLOBAL:: namespace.
ja: 真のグローバルは常にGLOBAL::名前空間の中にあります。

source: The PROCESS:: namespace, shared by all interpreters within the process, is notionally outside of GLOBAL::, but package searches do not look there for anything.
ja: PROCESS::名前空間は，プロセスの範囲でのインタプリタ全体で共有され、表記としてGLOBAL::の外側にあり、パッケージ検索はそこを探しません。

source: (Contextual variable searches do; $*PID will eventually locate $PROCESS::PID if not hidden by an inner context's $PID.)
ja: (コンテキスト変数検索は探すようになっていて、内側のコンテキストの$PIDによって隠されていなければ、$*PIDは最終的には$PROCESS::PIDを探し出せます。)

source: A package (or any other similar namespace) can control autoloading.
ja: パッケージ(やそれ以外の同様な名前空間)はオートロードを制御できます。

source: However, Perl 5's AUTOLOAD is being superseded by MMD autoloaders that distinguish declaration from definition, but are not restricted to declaring subs.
ja: Perl5のAUTOLOADは定義と宣言を区別するMMDのオートローダに取って代わられ、スタブを宣言することに制限されていません。

source: A run-time declarator multisub is declared as:
ja: 実行時の宣言のマルチスタブは

source: which stands in for the declaration of a container object within another container object; it is called when anyone is searching for a name in the package (or module, or class), and the name doesn't already exist in the package.
ja: のように宣言されています。これは別のコンテナオブジェクトの中のコンテナオブジェクトの宣言の代わりをしています。パッケージ(やモジュールやクラス)の中で名前を探す場合に呼ばれます。その名前はパッケージの中に既に存在している訳ではありません。

source: (In particular, .can calls CANDO when trying to determine if a class supports a particular method.) The arguments to CANDO include type information on what kind of object is expected in context, or this may be intuited from the name requested.
ja: (特にクラスが特定のメソッドをサポートしているかどうかを判断しようとする場合には.canはCANDOを呼び出します。)CANDOへの引数はコンテキストで期待されるオブジェクトの種類の型情報を含みます。これは呼び出される名前からも直感的でしょう。

source: In any case, there may be multiple CANDO routines that are dispatched via MMD:
ja: 全ての場合で、MMD経由でディスパッチされるマルチなCANDOルーチンが存在する可能性はある。

source: The package itself is just passed as the first argument, since it's the container object.
ja: パッケージ自身はコンテナオブジェクトなので、最初の引数として渡されます。

source: Subsequent arguments identify the desired type of the inner container and the "name" or "key" by which the object is to be looked up in the outer container.
ja: 後続の引数は外側のコンテナから探されたオブジェクトによって内部コンテナとして望まれた型と"名前"や"キィ"を特定します。

source: Such a name does not include its container name, unlike Perl 5's magical $AUTOLOAD variable.
ja: その名前にはコンテナの名前を含みません。Perl5のマジカルな$AUTOLOAD変数と違い。

source: Nor does it include the type information of a Code object's "long name"; this information comes in via the type parameter, and may be matched against using ordinary subsignature matching:
ja: コードオブジェクトの"長い名前"の型情報は含んでいないが、この情報は型パラメータに現われ、通常のサブシグネチャマッチを使いマッチされるでしょう。

source: The slurpy %args hash is likely to be empty in standard Perl 6 usage, but it's possible that some dialects of Perl will desire a mechanism to pass in additional contextual information, so this parameter is reserved for such purposes.
ja: 通常のPerl6 の使用法では、丸呑み%argsハッシュは空になりそうですが、渡すメカニズムを追加のコンテキスト情報の中で要求することが可能なPerlの方言もあります。そのためこのパラメータはこのような目的に対して予約されています。

source: The CANDO is expected to return an inner container object of the proper sort (i.e. a variable, subroutine, or method object), or a proxy object that can "autovivify" lazily, or undef if that name is not to be considered declared in the namespace in question.
ja: その名前が質問の際に名前空間に宣言されていないと考えられる場合、適切な種類(例えば、変数、サブルーチン、メソッドオブジェクト)の内部のコンテナオブジェクト、怠惰な"自動活性"のプロキシオブジェクト、undefを返すことをCANDOは期待されています。

source: (Only bare undef is interpreted as "not there", since typed undefs may function as autovivifiable proxy objects.
ja: (型付けられたundefは自動活性可能なプロキシオブジェクトとして機能しますので、裸のundefは、"そこに無い"として解釈されます。

source: See S12.)
ja: S12 参照のこと。)

source: The declaration merely defines the interface to the new object.
ja: 宣言は単に新しいオブジェクトへのインターフェイスを定義します。

source: That object need not be completely defined yet, though the CANDO routine is certainly allowed to define it eagerly, and even install the inner object into the outer container (the symbol table) if it wants to cache the declaration.
ja: そのオブジェクトはそのときまでには完全に定義されることを必要としませんが、宣言のキャッシュを望めばCANDOルーチンはそれを積極的に定義すること、内部オブジェクトを外部コンテナ(シンボルテーブル)に設定することを確実に許可します。

source: At declaration time it might not yet be known whether the inner container object will be used in lvalue or rvalue context; the use of a proxy object can supply either readonly or rw semantics later.
ja: 宣言時には、まだ内部コンテナオブジェクトがlvalue、rvalueコンテキストのどちらで使われるかがわかっていないかもしれません。プロキシオブジェクトを使う場合、読み込み専用か読み書き可能な動作のどちらかが後で提供されます。

source: When the package in question is a class, it is also possible to declare real methods or submethods:
ja: 質問時のパッケージがクラスの場合、実際のメソッドやサブメソッドを宣言することも可能です。

source: The method form is inherited by subclasses.
ja: メソッド形式はサブクラスにっよって継承されます。

source: Submethods are never inherited but may still do MMD within the class.
ja: サブメソッドは継承されませんが、クラスの範囲でMMDは起きます。

source: (Ordinary multisubs are inherited only to the extent allowed by the MMD mechanism.)
ja: (通常のマルチスタブはMMDメカニズムによって許可された拡張に対してのみ継承されます。)
